Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0128gpm064.h
extern volatile __REFO1CONbits_t REFO1CONbits __asm__ ("REFO1CON") __attribute__((section("sfrs"), address(0xBF802720)));
extern volatile uint32_t        REFO1CONCLR __attribute__((section("sfrs"),address(0xBF802724)));
extern volatile uint32_t        REFO1CONSET __attribute__((section("sfrs"),address(0xBF802728)));
extern volatile uint32_t        REFO1CONINV __attribute__((section("sfrs"),address(0xBF80272C)));
#define REFO1TRIM REFO1TRIM
extern volatile uint32_t   REFO1TRIM __attribute__((section("sfrs"), address(0xBF802730)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO1TRIMbits_t;
extern volatile __REFO1TRIMbits_t REFO1TRIMbits __asm__ ("REFO1TRIM") __attribute__((section("sfrs"), address(0xBF802730)));
extern volatile uint32_t        REFO1TRIMCLR __attribute__((section("sfrs"),address(0xBF802734)));
extern volatile uint32_t        REFO1TRIMSET __attribute__((section("sfrs"),address(0xBF802738)));
extern volatile uint32_t        REFO1TRIMINV __attribute__((section("sfrs"),address(0xBF80273C)));
#define CLKSTAT CLKSTAT
extern volatile uint32_t   CLKSTAT __attribute__((section("sfrs"), address(0xBF802770)));
typedef union {
  struct {
    uint32_t FRCRDY:1;
    uint32_t SPDIVRDY:1;
    uint32_t POSCRDY:1;
    uint32_t :1;
    uint32_t SOSCRDY:1;
    uint32_t LPRCRDY:1;
    uint32_t :1;
    uint32_t SPLLRDY:1;
  };
  struct {
    uint32_t :1;
    uint32_t DIVSPLLRDY:1;
  };
} __CLKSTATbits_t;
extern volatile __CLKSTATbits_t CLKSTATbits __asm__ ("CLKSTAT") __attribute__((section("sfrs"), address(0xBF802770)));
extern volatile uint32_t        CLKSTATCLR __attribute__((section("sfrs"),address(0xBF802774)));
extern volatile uint32_t        CLKSTATSET __attribute__((section("sfrs"),address(0xBF802778)));
extern volatile uint32_t        CLKSTATINV __attribute__((section("sfrs"),address(0xBF80277C)));
#define OSCTUN OSCTUN
extern volatile uint32_t   OSCTUN __attribute__((section("sfrs"), address(0xBF802880)));
typedef struct {
  uint32_t TUN:6;
  uint32_t :2;
  uint32_t ORPOL:1;
  uint32_t OR:1;
  uint32_t POL:1;
  uint32_t LOCK:1;
  uint32_t SRC:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs"), address(0xBF802880)));
extern volatile uint32_t        OSCTUNCLR __attribute__((section("sfrs"),address(0xBF802884)));
extern volatile uint32_t        OSCTUNSET __attribute__((section("sfrs"),address(0xBF802888)));
extern volatile uint32_t        OSCTUNINV __attribute__((section("sfrs"),address(0xBF80288C)));
#define ANCFG ANCFG
extern volatile uint32_t   ANCFG __attribute__((section("sfrs"), address(0xBF802910)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t BGCMP:1;
    uint32_t BGADC:1;
  };
  struct {
    uint32_t :1;
    uint32_t VBGCMP:1;
    uint32_t VBGADC:1;
  };
} __ANCFGbits_t;
extern volatile __ANCFGbits_t ANCFGbits __asm__ ("ANCFG") __attribute__((section("sfrs"), address(0xBF802910)));
extern volatile uint32_t        ANCFGCLR __attribute__((section("sfrs"),address(0xBF802914)));
extern volatile uint32_t        ANCFGSET __attribute__((section("sfrs"),address(0xBF802918)));
extern volatile uint32_t        ANCFGINV __attribute__((section("sfrs"),address(0xBF80291C)));
#define HLVDCON HLVDCON
extern volatile uint32_t   HLVDCON __attribute__((section("sfrs"), address(0xBF802920)));
typedef struct {
  uint32_t HLVDL:4;
  uint32_t :4;
  uint32_t HLEVT:1;
  uint32_t IRVST:1;
  uint32_t BGVST:1;
  uint32_t VDIR:1;
  uint32_t :1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __HLVDCONbits_t;
extern volatile __HLVDCONbits_t HLVDCONbits __asm__ ("HLVDCON") __attribute__((section("sfrs"), address(0xBF802920)));
extern volatile uint32_t        HLVDCONCLR __attribute__((section("sfrs"),address(0xBF802924)));
extern volatile uint32_t        HLVDCONSET __attribute__((section("sfrs"),address(0xBF802928)));
extern volatile uint32_t        HLVDCONINV __attribute__((section("sfrs"),address(0xBF80292C)));
#define NVMCON NVMCON
extern volatile uint32_t   NVMCON __attribute__((section("sfrs"), address(0xBF802930)));
typedef struct {
  uint32_t NVMOP:4;
  uint32_t :8;
  uint32_t LVDERR:1;
  uint32_t WRERR:1;
  uint32_t WREN:1;
  uint32_t WR:1;
} __NVMCONbits_t;
extern volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs"), address(0xBF802930)));
extern volatile uint32_t        NVMCONCLR __attribute__((section("sfrs"),address(0xBF802934)));
extern volatile uint32_t        NVMCONSET __attribute__((section("sfrs"),address(0xBF802938)));
extern volatile uint32_t        NVMCONINV __attribute__((section("sfrs"),address(0xBF80293C)));
#define NVMKEY NVMKEY
extern volatile uint32_t   NVMKEY __attribute__((section("sfrs"), address(0xBF802940)));
typedef struct {
  uint32_t NVMKEY:32;
} __NVMKEYbits_t;
extern volatile __NVMKEYbits_t NVMKEYbits __asm__ ("NVMKEY") __attribute__((section("sfrs"), address(0xBF802940)));
extern volatile uint32_t        NVMKEYCLR __attribute__((section("sfrs"),address(0xBF802944)));
extern volatile uint32_t        NVMKEYSET __attribute__((section("sfrs"),address(0xBF802948)));
extern volatile uint32_t        NVMKEYINV __attribute__((section("sfrs"),address(0xBF80294C)));
#define NVMADDR NVMADDR
extern volatile uint32_t   NVMADDR __attribute__((section("sfrs"), address(0xBF802950)));
typedef struct {
  uint32_t NVMADDR:32;
} __NVMADDRbits_t;
extern volatile __NVMADDRbits_t NVMADDRbits __asm__ ("NVMADDR") __attribute__((section("sfrs"), address(0xBF802950)));
extern volatile uint32_t        NVMADDRCLR __attribute__((section("sfrs"),address(0xBF802954)));
extern volatile uint32_t        NVMADDRSET __attribute__((section("sfrs"),address(0xBF802958)));
extern volatile uint32_t        NVMADDRINV __attribute__((section("sfrs"),address(0xBF80295C)));
#define NVMDATA0 NVMDATA0
extern volatile uint32_t   NVMDATA0 __attribute__((section("sfrs"), address(0xBF802960)));
typedef struct {
  uint32_t NVMDATA0:32;
} __NVMDATA0bits_t;
