Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0128gpm064.h
extern volatile __CNEN0Bbits_t CNEN0Bbits __asm__ ("CNEN0B") __attribute__((section("sfrs"), address(0xBF802D30)));
extern volatile uint32_t        CNEN0BCLR __attribute__((section("sfrs"),address(0xBF802D34)));
extern volatile uint32_t        CNEN0BSET __attribute__((section("sfrs"),address(0xBF802D38)));
extern volatile uint32_t        CNEN0BINV __attribute__((section("sfrs"),address(0xBF802D3C)));
#define CNSTATB CNSTATB
extern volatile uint32_t   CNSTATB __attribute__((section("sfrs"), address(0xBF802D40)));
typedef union {
  struct {
    uint32_t CNSTATB0:1;
    uint32_t CNSTATB1:1;
    uint32_t CNSTATB2:1;
    uint32_t CNSTATB3:1;
    uint32_t CNSTATB4:1;
    uint32_t CNSTATB5:1;
    uint32_t CNSTATB6:1;
    uint32_t CNSTATB7:1;
    uint32_t CNSTATB8:1;
    uint32_t CNSTATB9:1;
    uint32_t CNSTATB10:1;
    uint32_t CNSTATB11:1;
    uint32_t :1;
    uint32_t CNSTATB13:1;
    uint32_t CNSTATB14:1;
    uint32_t CNSTATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF802D40)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF802D44)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF802D48)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF802D4C)));
#define CNEN1B CNEN1B
extern volatile uint32_t   CNEN1B __attribute__((section("sfrs"), address(0xBF802D50)));
typedef union {
  struct {
    uint32_t CNIE1B0:1;
    uint32_t CNIE1B1:1;
    uint32_t CNIE1B2:1;
    uint32_t CNIE1B3:1;
    uint32_t CNIE1B4:1;
    uint32_t CNIE1B5:1;
    uint32_t CNIE1B6:1;
    uint32_t CNIE1B7:1;
    uint32_t CNIE1B8:1;
    uint32_t CNIE1B9:1;
    uint32_t CNIE1B10:1;
    uint32_t CNIE1B11:1;
    uint32_t :1;
    uint32_t CNIE1B13:1;
    uint32_t CNIE1B14:1;
    uint32_t CNIE1B15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN1Bbits_t;
extern volatile __CNEN1Bbits_t CNEN1Bbits __asm__ ("CNEN1B") __attribute__((section("sfrs"), address(0xBF802D50)));
extern volatile uint32_t        CNEN1BCLR __attribute__((section("sfrs"),address(0xBF802D54)));
extern volatile uint32_t        CNEN1BSET __attribute__((section("sfrs"),address(0xBF802D58)));
extern volatile uint32_t        CNEN1BINV __attribute__((section("sfrs"),address(0xBF802D5C)));
#define CNFB CNFB
extern volatile uint32_t   CNFB __attribute__((section("sfrs"), address(0xBF802D60)));
typedef union {
  struct {
    uint32_t CNFB0:1;
    uint32_t CNFB1:1;
    uint32_t CNFB2:1;
    uint32_t CNFB3:1;
    uint32_t CNFB4:1;
    uint32_t CNFB5:1;
    uint32_t CNFB6:1;
    uint32_t CNFB7:1;
    uint32_t CNFB8:1;
    uint32_t CNFB9:1;
    uint32_t CNFB10:1;
    uint32_t CNFB11:1;
    uint32_t :1;
    uint32_t CNFB13:1;
    uint32_t CNFB14:1;
    uint32_t CNFB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs"), address(0xBF802D60)));
extern volatile uint32_t        CNFBCLR __attribute__((section("sfrs"),address(0xBF802D64)));
extern volatile uint32_t        CNFBSET __attribute__((section("sfrs"),address(0xBF802D68)));
extern volatile uint32_t        CNFBINV __attribute__((section("sfrs"),address(0xBF802D6C)));
#define SR0B SR0B
extern volatile uint32_t   SR0B __attribute__((section("sfrs"), address(0xBF802D70)));
typedef struct {
  uint32_t w:32;
} __SR0Bbits_t;
extern volatile __SR0Bbits_t SR0Bbits __asm__ ("SR0B") __attribute__((section("sfrs"), address(0xBF802D70)));
extern volatile uint32_t        SR0BCLR __attribute__((section("sfrs"),address(0xBF802D74)));
extern volatile uint32_t        SR0BSET __attribute__((section("sfrs"),address(0xBF802D78)));
extern volatile uint32_t        SR0BINV __attribute__((section("sfrs"),address(0xBF802D7C)));
#define SR1B SR1B
extern volatile uint32_t   SR1B __attribute__((section("sfrs"), address(0xBF802D80)));
typedef struct {
  uint32_t w:32;
} __SR1Bbits_t;
extern volatile __SR1Bbits_t SR1Bbits __asm__ ("SR1B") __attribute__((section("sfrs"), address(0xBF802D80)));
extern volatile uint32_t        SR1BCLR __attribute__((section("sfrs"),address(0xBF802D84)));
extern volatile uint32_t        SR1BSET __attribute__((section("sfrs"),address(0xBF802D88)));
extern volatile uint32_t        SR1BINV __attribute__((section("sfrs"),address(0xBF802D8C)));
#define ANSELC ANSELC
extern volatile uint32_t   ANSELC __attribute__((section("sfrs"), address(0xBF802DB0)));
typedef union {
  struct {
    uint32_t ANSC0:1;
    uint32_t ANSC1:1;
    uint32_t :3;
    uint32_t ANSC5:1;
    uint32_t :2;
    uint32_t ANSC8:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELCbits_t;
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs"), address(0xBF802DB0)));
extern volatile uint32_t        ANSELCCLR __attribute__((section("sfrs"),address(0xBF802DB4)));
extern volatile uint32_t        ANSELCSET __attribute__((section("sfrs"),address(0xBF802DB8)));
extern volatile uint32_t        ANSELCINV __attribute__((section("sfrs"),address(0xBF802DBC)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF802DC0)));
typedef union {
  struct {
    uint32_t TRISC0:1;
    uint32_t TRISC1:1;
    uint32_t TRISC2:1;
    uint32_t TRISC3:1;
    uint32_t TRISC4:1;
    uint32_t TRISC5:1;
    uint32_t TRISC6:1;
    uint32_t TRISC7:1;
    uint32_t TRISC8:1;
    uint32_t TRISC9:1;
    uint32_t TRISC10:1;
    uint32_t TRISC11:1;
    uint32_t TRISC12:1;
    uint32_t TRISC13:1;
    uint32_t TRISC14:1;
    uint32_t TRISC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF802DC0)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF802DC4)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF802DC8)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF802DCC)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF802DD0)));
typedef union {
  struct {
    uint32_t RC0:1;
    uint32_t RC1:1;
    uint32_t RC2:1;
    uint32_t RC3:1;
    uint32_t RC4:1;
    uint32_t RC5:1;
    uint32_t RC6:1;
    uint32_t RC7:1;
    uint32_t RC8:1;
    uint32_t RC9:1;
    uint32_t RC10:1;
    uint32_t RC11:1;
    uint32_t RC12:1;
    uint32_t RC13:1;
    uint32_t RC14:1;
    uint32_t RC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF802DD0)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF802DD4)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF802DD8)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF802DDC)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF802DE0)));
typedef union {
  struct {
    uint32_t LATC0:1;
    uint32_t LATC1:1;
    uint32_t LATC2:1;
    uint32_t LATC3:1;
    uint32_t LATC4:1;
    uint32_t LATC5:1;
    uint32_t LATC6:1;
    uint32_t LATC7:1;
    uint32_t LATC8:1;
    uint32_t LATC9:1;
    uint32_t LATC10:1;
    uint32_t LATC11:1;
    uint32_t LATC12:1;
    uint32_t LATC13:1;
    uint32_t LATC14:1;
    uint32_t LATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF802DE0)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF802DE4)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF802DE8)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF802DEC)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF802DF0)));
typedef union {
  struct {
    uint32_t ODCC0:1;
    uint32_t ODCC1:1;
    uint32_t ODCC2:1;
    uint32_t ODCC3:1;
    uint32_t ODCC4:1;
    uint32_t ODCC5:1;
    uint32_t ODCC6:1;
    uint32_t ODCC7:1;
    uint32_t ODCC8:1;
    uint32_t ODCC9:1;
    uint32_t ODCC10:1;
    uint32_t ODCC11:1;
    uint32_t ODCC12:1;
    uint32_t ODCC13:1;
    uint32_t ODCC14:1;
    uint32_t ODCC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF802DF0)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF802DF4)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF802DF8)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF802DFC)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF802E00)));
typedef union {
  struct {
    uint32_t CNPUC0:1;
    uint32_t CNPUC1:1;
    uint32_t CNPUC2:1;
    uint32_t CNPUC3:1;
    uint32_t CNPUC4:1;
    uint32_t CNPUC5:1;
    uint32_t CNPUC6:1;
    uint32_t CNPUC7:1;
    uint32_t CNPUC8:1;
    uint32_t CNPUC9:1;
    uint32_t CNPUC10:1;
    uint32_t CNPUC11:1;
    uint32_t CNPUC12:1;
    uint32_t CNPUC13:1;
    uint32_t CNPUC14:1;
    uint32_t CNPUC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
