Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0128gpm064.h
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs"), address(0xBF80F290)));
extern volatile uint32_t        IPC21CLR __attribute__((section("sfrs"),address(0xBF80F294)));
extern volatile uint32_t        IPC21SET __attribute__((section("sfrs"),address(0xBF80F298)));
extern volatile uint32_t        IPC21INV __attribute__((section("sfrs"),address(0xBF80F29C)));
#define IPC22 IPC22
extern volatile uint32_t   IPC22 __attribute__((section("sfrs"), address(0xBF80F2A0)));
typedef struct {
  uint32_t CCP8IS:2;
  uint32_t CCP8IP:3;
  uint32_t :3;
  uint32_t CCT8IS:2;
  uint32_t CCT8IP:3;
  uint32_t :3;
  uint32_t CCP9IS:2;
  uint32_t CCP9IP:3;
  uint32_t :3;
  uint32_t CCT9IS:2;
  uint32_t CCT9IP:3;
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs"), address(0xBF80F2A0)));
extern volatile uint32_t        IPC22CLR __attribute__((section("sfrs"),address(0xBF80F2A4)));
extern volatile uint32_t        IPC22SET __attribute__((section("sfrs"),address(0xBF80F2A8)));
extern volatile uint32_t        IPC22INV __attribute__((section("sfrs"),address(0xBF80F2AC)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF80F2B0)));
typedef struct {
  uint32_t FSTIS:2;
  uint32_t FSTIP:3;
  uint32_t :11;
  uint32_t NVMIS:2;
  uint32_t NVMIP:3;
  uint32_t :3;
  uint32_t CPCIS:2;
  uint32_t CPCIP:3;
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs"), address(0xBF80F2B0)));
extern volatile uint32_t        IPC23CLR __attribute__((section("sfrs"),address(0xBF80F2B4)));
extern volatile uint32_t        IPC23SET __attribute__((section("sfrs"),address(0xBF80F2B8)));
extern volatile uint32_t        IPC23INV __attribute__((section("sfrs"),address(0xBF80F2BC)));
#define IPC24 IPC24
extern volatile uint32_t   IPC24 __attribute__((section("sfrs"), address(0xBF80F2C0)));
typedef struct {
  uint32_t :8;
  uint32_t ECCBEIS:2;
  uint32_t ECCBEIP:3;
  uint32_t :3;
  uint32_t DMA0IS:2;
  uint32_t DMA0IP:3;
  uint32_t :3;
  uint32_t DMA1IS:2;
  uint32_t DMA1IP:3;
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs"), address(0xBF80F2C0)));
extern volatile uint32_t        IPC24CLR __attribute__((section("sfrs"),address(0xBF80F2C4)));
extern volatile uint32_t        IPC24SET __attribute__((section("sfrs"),address(0xBF80F2C8)));
extern volatile uint32_t        IPC24INV __attribute__((section("sfrs"),address(0xBF80F2CC)));
#define IPC25 IPC25
extern volatile uint32_t   IPC25 __attribute__((section("sfrs"), address(0xBF80F2D0)));
typedef struct {
  uint32_t DMA2IS:2;
  uint32_t DMA2IP:3;
  uint32_t :3;
  uint32_t DMA3IS:2;
  uint32_t DMA3IP:3;
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs"), address(0xBF80F2D0)));
extern volatile uint32_t        IPC25CLR __attribute__((section("sfrs"),address(0xBF80F2D4)));
extern volatile uint32_t        IPC25SET __attribute__((section("sfrs"),address(0xBF80F2D8)));
extern volatile uint32_t        IPC25INV __attribute__((section("sfrs"),address(0xBF80F2DC)));
#define UDID1 UDID1
extern volatile uint32_t   UDID1 __attribute__((section("sfrs"), address(0xBFC41840)));
#define UDID2 UDID2
extern volatile uint32_t   UDID2 __attribute__((section("sfrs"), address(0xBFC41844)));
#define UDID3 UDID3
extern volatile uint32_t   UDID3 __attribute__((section("sfrs"), address(0xBFC41848)));
#define UDID4 UDID4
extern volatile uint32_t   UDID4 __attribute__((section("sfrs"), address(0xBFC4184C)));
#define UDID5 UDID5
extern volatile uint32_t   UDID5 __attribute__((section("sfrs"), address(0xBFC41850)));
#define FDEVOPT FDEVOPT
extern volatile uint32_t   FDEVOPT __attribute__((section("sfrs"), address(0xBFC017C4)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t SOSCHP:1;
    uint32_t ALTI2C:1;
    uint32_t :9;
    uint32_t FUSBIDIO:1;
    uint32_t FVBUSIO:1;
    uint32_t USERID:16;
  };
  struct {
    uint32_t w:32;
  };
} __FDEVOPTbits_t;
extern volatile __FDEVOPTbits_t FDEVOPTbits __asm__ ("FDEVOPT") __attribute__((section("sfrs"), address(0xBFC017C4)));
#define FICD FICD
extern volatile uint32_t   FICD __attribute__((section("sfrs"), address(0xBFC017C8)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t JTAGEN:1;
    uint32_t ICS:2;
  };
  struct {
    uint32_t w:32;
  };
} __FICDbits_t;
extern volatile __FICDbits_t FICDbits __asm__ ("FICD") __attribute__((section("sfrs"), address(0xBFC017C8)));
#define FPOR FPOR
extern volatile uint32_t   FPOR __attribute__((section("sfrs"), address(0xBFC017CC)));
typedef union {
  struct {
    uint32_t BOREN:2;
    uint32_t RETVR:1;
    uint32_t LPBOREN:1;
  };
  struct {
    uint32_t w:32;
  };
} __FPORbits_t;
extern volatile __FPORbits_t FPORbits __asm__ ("FPOR") __attribute__((section("sfrs"), address(0xBFC017CC)));
#define FWDT FWDT
extern volatile uint32_t   FWDT __attribute__((section("sfrs"), address(0xBFC017D0)));
typedef union {
  struct {
    uint32_t SWDTPS:5;
    uint32_t FWDTWINSZ:2;
    uint32_t WINDIS:1;
    uint32_t RWDTPS:5;
    uint32_t RCLKSEL:2;
    uint32_t FWDTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __FWDTbits_t;
extern volatile __FWDTbits_t FWDTbits __asm__ ("FWDT") __attribute__((section("sfrs"), address(0xBFC017D0)));
#define FOSCSEL FOSCSEL
extern volatile uint32_t   FOSCSEL __attribute__((section("sfrs"), address(0xBFC017D4)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t :1;
    uint32_t PLLSRC:1;
    uint32_t :1;
    uint32_t SOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :1;
    uint32_t SOSCSEL:1;
    uint32_t :1;
    uint32_t FCKSM:2;
  };
  struct {
    uint32_t w:32;
  };
} __FOSCSELbits_t;
extern volatile __FOSCSELbits_t FOSCSELbits __asm__ ("FOSCSEL") __attribute__((section("sfrs"), address(0xBFC017D4)));
#define FSEC FSEC
extern volatile uint32_t   FSEC __attribute__((section("sfrs"), address(0xBFC017D8)));
typedef union {
  struct {
    uint32_t :31;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __FSECbits_t;
extern volatile __FSECbits_t FSECbits __asm__ ("FSEC") __attribute__((section("sfrs"), address(0xBFC017D8)));
#define AFDEVOPT AFDEVOPT
extern volatile uint32_t   AFDEVOPT __attribute__((section("sfrs"), address(0xBFC01744)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t SOSCHP:1;
    uint32_t ALTI2C:1;
    uint32_t :9;
    uint32_t FUSBIDIO:1;
    uint32_t FVBUSIO:1;
    uint32_t USERID:16;
  };
  struct {
    uint32_t w:32;
  };
} __AFDEVOPTbits_t;
extern volatile __AFDEVOPTbits_t AFDEVOPTbits __asm__ ("AFDEVOPT") __attribute__((section("sfrs"), address(0xBFC01744)));
#define AFICD AFICD
extern volatile uint32_t   AFICD __attribute__((section("sfrs"), address(0xBFC01748)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t JTAGEN:1;
    uint32_t ICS:2;
  };
  struct {
    uint32_t w:32;
  };
} __AFICDbits_t;
