Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0128gpm064.h
#define _DAC1CON_REFSEL_POSITION                 0x00000000
#define _DAC1CON_REFSEL_MASK                     0x00000003
#define _DAC1CON_REFSEL_LENGTH                   0x00000002

#define _DAC1CON_DACOE_POSITION                  0x00000008
#define _DAC1CON_DACOE_MASK                      0x00000100
#define _DAC1CON_DACOE_LENGTH                    0x00000001

#define _DAC1CON_ON_POSITION                     0x0000000F
#define _DAC1CON_ON_MASK                         0x00008000
#define _DAC1CON_ON_LENGTH                       0x00000001

#define _DAC1CON_DACDAT_POSITION                 0x00000010
#define _DAC1CON_DACDAT_MASK                     0xFFFF0000
#define _DAC1CON_DACDAT_LENGTH                   0x00000010

#define _CLC1CON_MODE_POSITION                   0x00000000
#define _CLC1CON_MODE_MASK                       0x00000007
#define _CLC1CON_MODE_LENGTH                     0x00000003

#define _CLC1CON_LCPOL_POSITION                  0x00000005
#define _CLC1CON_LCPOL_MASK                      0x00000020
#define _CLC1CON_LCPOL_LENGTH                    0x00000001

#define _CLC1CON_LCOUT_POSITION                  0x00000006
#define _CLC1CON_LCOUT_MASK                      0x00000040
#define _CLC1CON_LCOUT_LENGTH                    0x00000001

#define _CLC1CON_LCOE_POSITION                   0x00000007
#define _CLC1CON_LCOE_MASK                       0x00000080
#define _CLC1CON_LCOE_LENGTH                     0x00000001

#define _CLC1CON_INTN_POSITION                   0x0000000A
#define _CLC1CON_INTN_MASK                       0x00000400
#define _CLC1CON_INTN_LENGTH                     0x00000001

#define _CLC1CON_INTP_POSITION                   0x0000000B
#define _CLC1CON_INTP_MASK                       0x00000800
#define _CLC1CON_INTP_LENGTH                     0x00000001

#define _CLC1CON_ON_POSITION                     0x0000000F
#define _CLC1CON_ON_MASK                         0x00008000
#define _CLC1CON_ON_LENGTH                       0x00000001

#define _CLC1CON_G1POL_POSITION                  0x00000010
#define _CLC1CON_G1POL_MASK                      0x00010000
#define _CLC1CON_G1POL_LENGTH                    0x00000001

#define _CLC1CON_G2POL_POSITION                  0x00000011
#define _CLC1CON_G2POL_MASK                      0x00020000
#define _CLC1CON_G2POL_LENGTH                    0x00000001

#define _CLC1CON_G3POL_POSITION                  0x00000012
#define _CLC1CON_G3POL_MASK                      0x00040000
#define _CLC1CON_G3POL_LENGTH                    0x00000001

#define _CLC1CON_G4POL_POSITION                  0x00000013
#define _CLC1CON_G4POL_MASK                      0x00080000
#define _CLC1CON_G4POL_LENGTH                    0x00000001

#define _CLC1SEL_DS1_POSITION                    0x00000000
#define _CLC1SEL_DS1_MASK                        0x00000007
#define _CLC1SEL_DS1_LENGTH                      0x00000003

#define _CLC1SEL_DS2_POSITION                    0x00000004
#define _CLC1SEL_DS2_MASK                        0x00000070
#define _CLC1SEL_DS2_LENGTH                      0x00000003

#define _CLC1SEL_DS3_POSITION                    0x00000008
#define _CLC1SEL_DS3_MASK                        0x00000700
#define _CLC1SEL_DS3_LENGTH                      0x00000003

#define _CLC1SEL_DS4_POSITION                    0x0000000C
#define _CLC1SEL_DS4_MASK                        0x00007000
#define _CLC1SEL_DS4_LENGTH                      0x00000003

#define _CLC1GLS_G1D1N_POSITION                  0x00000000
#define _CLC1GLS_G1D1N_MASK                      0x00000001
#define _CLC1GLS_G1D1N_LENGTH                    0x00000001

#define _CLC1GLS_G1D1T_POSITION                  0x00000001
#define _CLC1GLS_G1D1T_MASK                      0x00000002
#define _CLC1GLS_G1D1T_LENGTH                    0x00000001

#define _CLC1GLS_G1D2N_POSITION                  0x00000002
#define _CLC1GLS_G1D2N_MASK                      0x00000004
#define _CLC1GLS_G1D2N_LENGTH                    0x00000001

#define _CLC1GLS_G1D2T_POSITION                  0x00000003
#define _CLC1GLS_G1D2T_MASK                      0x00000008
#define _CLC1GLS_G1D2T_LENGTH                    0x00000001

#define _CLC1GLS_G1D3N_POSITION                  0x00000004
#define _CLC1GLS_G1D3N_MASK                      0x00000010
#define _CLC1GLS_G1D3N_LENGTH                    0x00000001

#define _CLC1GLS_G1D3T_POSITION                  0x00000005
#define _CLC1GLS_G1D3T_MASK                      0x00000020
#define _CLC1GLS_G1D3T_LENGTH                    0x00000001

#define _CLC1GLS_G1D4N_POSITION                  0x00000006
#define _CLC1GLS_G1D4N_MASK                      0x00000040
#define _CLC1GLS_G1D4N_LENGTH                    0x00000001

#define _CLC1GLS_G1D4T_POSITION                  0x00000007
#define _CLC1GLS_G1D4T_MASK                      0x00000080
#define _CLC1GLS_G1D4T_LENGTH                    0x00000001

#define _CLC1GLS_G2D1N_POSITION                  0x00000008
#define _CLC1GLS_G2D1N_MASK                      0x00000100
#define _CLC1GLS_G2D1N_LENGTH                    0x00000001

#define _CLC1GLS_G2D1T_POSITION                  0x00000009
#define _CLC1GLS_G2D1T_MASK                      0x00000200
#define _CLC1GLS_G2D1T_LENGTH                    0x00000001

#define _CLC1GLS_G2D2N_POSITION                  0x0000000A
#define _CLC1GLS_G2D2N_MASK                      0x00000400
#define _CLC1GLS_G2D2N_LENGTH                    0x00000001

#define _CLC1GLS_G2D2T_POSITION                  0x0000000B
#define _CLC1GLS_G2D2T_MASK                      0x00000800
#define _CLC1GLS_G2D2T_LENGTH                    0x00000001

#define _CLC1GLS_G2D3N_POSITION                  0x0000000C
#define _CLC1GLS_G2D3N_MASK                      0x00001000
#define _CLC1GLS_G2D3N_LENGTH                    0x00000001

#define _CLC1GLS_G2D3T_POSITION                  0x0000000D
#define _CLC1GLS_G2D3T_MASK                      0x00002000
#define _CLC1GLS_G2D3T_LENGTH                    0x00000001

#define _CLC1GLS_G2D4N_POSITION                  0x0000000E
#define _CLC1GLS_G2D4N_MASK                      0x00004000
#define _CLC1GLS_G2D4N_LENGTH                    0x00000001

