Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0128gpm064.h
#define _IPC20_CCT5IP_POSITION                   0x0000001A
#define _IPC20_CCT5IP_MASK                       0x1C000000
#define _IPC20_CCT5IP_LENGTH                     0x00000003

#define _IPC21_CCP6IS_POSITION                   0x00000000
#define _IPC21_CCP6IS_MASK                       0x00000003
#define _IPC21_CCP6IS_LENGTH                     0x00000002

#define _IPC21_CCP6IP_POSITION                   0x00000002
#define _IPC21_CCP6IP_MASK                       0x0000001C
#define _IPC21_CCP6IP_LENGTH                     0x00000003

#define _IPC21_CCT6IS_POSITION                   0x00000008
#define _IPC21_CCT6IS_MASK                       0x00000300
#define _IPC21_CCT6IS_LENGTH                     0x00000002

#define _IPC21_CCT6IP_POSITION                   0x0000000A
#define _IPC21_CCT6IP_MASK                       0x00001C00
#define _IPC21_CCT6IP_LENGTH                     0x00000003

#define _IPC21_CCP7IS_POSITION                   0x00000010
#define _IPC21_CCP7IS_MASK                       0x00030000
#define _IPC21_CCP7IS_LENGTH                     0x00000002

#define _IPC21_CCP7IP_POSITION                   0x00000012
#define _IPC21_CCP7IP_MASK                       0x001C0000
#define _IPC21_CCP7IP_LENGTH                     0x00000003

#define _IPC21_CCT7IS_POSITION                   0x00000018
#define _IPC21_CCT7IS_MASK                       0x03000000
#define _IPC21_CCT7IS_LENGTH                     0x00000002

#define _IPC21_CCT7IP_POSITION                   0x0000001A
#define _IPC21_CCT7IP_MASK                       0x1C000000
#define _IPC21_CCT7IP_LENGTH                     0x00000003

#define _IPC22_CCP8IS_POSITION                   0x00000000
#define _IPC22_CCP8IS_MASK                       0x00000003
#define _IPC22_CCP8IS_LENGTH                     0x00000002

#define _IPC22_CCP8IP_POSITION                   0x00000002
#define _IPC22_CCP8IP_MASK                       0x0000001C
#define _IPC22_CCP8IP_LENGTH                     0x00000003

#define _IPC22_CCT8IS_POSITION                   0x00000008
#define _IPC22_CCT8IS_MASK                       0x00000300
#define _IPC22_CCT8IS_LENGTH                     0x00000002

#define _IPC22_CCT8IP_POSITION                   0x0000000A
#define _IPC22_CCT8IP_MASK                       0x00001C00
#define _IPC22_CCT8IP_LENGTH                     0x00000003

#define _IPC22_CCP9IS_POSITION                   0x00000010
#define _IPC22_CCP9IS_MASK                       0x00030000
#define _IPC22_CCP9IS_LENGTH                     0x00000002

#define _IPC22_CCP9IP_POSITION                   0x00000012
#define _IPC22_CCP9IP_MASK                       0x001C0000
#define _IPC22_CCP9IP_LENGTH                     0x00000003

#define _IPC22_CCT9IS_POSITION                   0x00000018
#define _IPC22_CCT9IS_MASK                       0x03000000
#define _IPC22_CCT9IS_LENGTH                     0x00000002

#define _IPC22_CCT9IP_POSITION                   0x0000001A
#define _IPC22_CCT9IP_MASK                       0x1C000000
#define _IPC22_CCT9IP_LENGTH                     0x00000003

#define _IPC23_FSTIS_POSITION                    0x00000000
#define _IPC23_FSTIS_MASK                        0x00000003
#define _IPC23_FSTIS_LENGTH                      0x00000002

#define _IPC23_FSTIP_POSITION                    0x00000002
#define _IPC23_FSTIP_MASK                        0x0000001C
#define _IPC23_FSTIP_LENGTH                      0x00000003

#define _IPC23_NVMIS_POSITION                    0x00000010
#define _IPC23_NVMIS_MASK                        0x00030000
#define _IPC23_NVMIS_LENGTH                      0x00000002

#define _IPC23_NVMIP_POSITION                    0x00000012
#define _IPC23_NVMIP_MASK                        0x001C0000
#define _IPC23_NVMIP_LENGTH                      0x00000003

#define _IPC23_CPCIS_POSITION                    0x00000018
#define _IPC23_CPCIS_MASK                        0x03000000
#define _IPC23_CPCIS_LENGTH                      0x00000002

#define _IPC23_CPCIP_POSITION                    0x0000001A
#define _IPC23_CPCIP_MASK                        0x1C000000
#define _IPC23_CPCIP_LENGTH                      0x00000003

#define _IPC24_ECCBEIS_POSITION                  0x00000008
#define _IPC24_ECCBEIS_MASK                      0x00000300
#define _IPC24_ECCBEIS_LENGTH                    0x00000002

#define _IPC24_ECCBEIP_POSITION                  0x0000000A
#define _IPC24_ECCBEIP_MASK                      0x00001C00
#define _IPC24_ECCBEIP_LENGTH                    0x00000003

#define _IPC24_DMA0IS_POSITION                   0x00000010
#define _IPC24_DMA0IS_MASK                       0x00030000
#define _IPC24_DMA0IS_LENGTH                     0x00000002

#define _IPC24_DMA0IP_POSITION                   0x00000012
#define _IPC24_DMA0IP_MASK                       0x001C0000
#define _IPC24_DMA0IP_LENGTH                     0x00000003

#define _IPC24_DMA1IS_POSITION                   0x00000018
#define _IPC24_DMA1IS_MASK                       0x03000000
#define _IPC24_DMA1IS_LENGTH                     0x00000002

#define _IPC24_DMA1IP_POSITION                   0x0000001A
#define _IPC24_DMA1IP_MASK                       0x1C000000
#define _IPC24_DMA1IP_LENGTH                     0x00000003

#define _IPC25_DMA2IS_POSITION                   0x00000000
#define _IPC25_DMA2IS_MASK                       0x00000003
#define _IPC25_DMA2IS_LENGTH                     0x00000002

#define _IPC25_DMA2IP_POSITION                   0x00000002
#define _IPC25_DMA2IP_MASK                       0x0000001C
#define _IPC25_DMA2IP_LENGTH                     0x00000003

#define _IPC25_DMA3IS_POSITION                   0x00000008
#define _IPC25_DMA3IS_MASK                       0x00000300
#define _IPC25_DMA3IS_LENGTH                     0x00000002

#define _IPC25_DMA3IP_POSITION                   0x0000000A
#define _IPC25_DMA3IP_MASK                       0x00001C00
#define _IPC25_DMA3IP_LENGTH                     0x00000003

#define _FDEVOPT_SOSCHP_POSITION                 0x00000003
#define _FDEVOPT_SOSCHP_MASK                     0x00000008
#define _FDEVOPT_SOSCHP_LENGTH                   0x00000001

#define _FDEVOPT_ALTI2C_POSITION                 0x00000004
#define _FDEVOPT_ALTI2C_MASK                     0x00000010
#define _FDEVOPT_ALTI2C_LENGTH                   0x00000001

#define _FDEVOPT_FUSBIDIO_POSITION               0x0000000E
#define _FDEVOPT_FUSBIDIO_MASK                   0x00004000
#define _FDEVOPT_FUSBIDIO_LENGTH                 0x00000001

#define _FDEVOPT_FVBUSIO_POSITION                0x0000000F
#define _FDEVOPT_FVBUSIO_MASK                    0x00008000
#define _FDEVOPT_FVBUSIO_LENGTH                  0x00000001

#define _FDEVOPT_USERID_POSITION                 0x00000010
#define _FDEVOPT_USERID_MASK                     0xFFFF0000
#define _FDEVOPT_USERID_LENGTH                   0x00000010

#define _FDEVOPT_w_POSITION                      0x00000000
#define _FDEVOPT_w_MASK                          0xFFFFFFFF
#define _FDEVOPT_w_LENGTH                        0x00000020

#define _FICD_JTAGEN_POSITION                    0x00000002
#define _FICD_JTAGEN_MASK                        0x00000004
#define _FICD_JTAGEN_LENGTH                      0x00000001

#define _FICD_ICS_POSITION                       0x00000003
#define _FICD_ICS_MASK                           0x00000018
#define _FICD_ICS_LENGTH                         0x00000002

#define _FICD_w_POSITION                         0x00000000
#define _FICD_w_MASK                             0xFFFFFFFF
#define _FICD_w_LENGTH                           0x00000020

#define _FPOR_BOREN_POSITION                     0x00000000
#define _FPOR_BOREN_MASK                         0x00000003
#define _FPOR_BOREN_LENGTH                       0x00000002

#define _FPOR_RETVR_POSITION                     0x00000002
#define _FPOR_RETVR_MASK                         0x00000004
#define _FPOR_RETVR_LENGTH                       0x00000001

#define _FPOR_LPBOREN_POSITION                   0x00000003
#define _FPOR_LPBOREN_MASK                       0x00000008
#define _FPOR_LPBOREN_LENGTH                     0x00000001

#define _FPOR_w_POSITION                         0x00000000
#define _FPOR_w_MASK                             0xFFFFFFFF
#define _FPOR_w_LENGTH                           0x00000020

#define _FWDT_SWDTPS_POSITION                    0x00000000
#define _FWDT_SWDTPS_MASK                        0x0000001F
#define _FWDT_SWDTPS_LENGTH                      0x00000005

#define _FWDT_FWDTWINSZ_POSITION                 0x00000005
#define _FWDT_FWDTWINSZ_MASK                     0x00000060
#define _FWDT_FWDTWINSZ_LENGTH                   0x00000002

#define _FWDT_WINDIS_POSITION                    0x00000007
#define _FWDT_WINDIS_MASK                        0x00000080
#define _FWDT_WINDIS_LENGTH                      0x00000001

